Repository: Stra1ghter/HahaBuch
Catalog: src/HahaBuch/Components/Account/Pages/Manage/UserOverview.*.resx
Languages: de

source: Edit user
de: Benutzer bearbeiten

# ChangeVaultWarning
source: Changing a vault will delete an existing one, when it has no users left.
de: Die Änderung der Tresorzuweisung löscht einen Tresor, wenn dieser keinem Benutzer mehr zugewiesen ist.

# MailUpdateFail
source: Failed to update mail.
de: E-Mail konnte nicht aktualisiert werden.

# MailUpdateSuccess
source: User's mail updated successfully
de: E-Mail erfolgreich aktualisiert.

# UsernameUpdateFail
source: Failed to update username.
de: Benutzername konnte nicht aktualisiert werden.

# UsernameUpdateSuccess
source: User's name updated successfully.
de: Benutzername erfolgreich aktualisiert.

# VaultUpdateSuccess
source: User's vault updated successfully.
de: Tresor erfolgreich aktualisiert.

# PreviousVaultUpdateSuccess
source: Previous vault '{0}' deleted.
de: Vorheriger Tresor '{0}' gelöscht.

# ProfileUpdateSuccess
source: The profile has been updated.
de: Das Profil wurde aktualisiert.

source: Delete user
de: Benutzer löschen

# DeleteUserWarning
source: This is a permanent action and cannot be recovered. If a vault has no other user left, this will delete the according vault!
de: Diese Aktion kann nicht rückgängig gemacht werden. Wenn ein Tresor keinem Benutzer zugewiesen ist, wird er automatisch gelöscht.

# DeleteUserCheckbox
source: Yes delete user '{0}'
de: Ja, Benutzer '{0}' löschen

source: Personal data
de: Personenbezogene Daten

# PersonalDataHint
source: Your account contains personal data that you have given us. This page allows you to download or delete that data. Deleting this data can result in deletion of all inserted data.
de: Dein Account enthält personenbezogene Daten, die du eingegeben hast. Auf dieser Seite kannst du diese Daten herunterladen oder löschen.

# PersonalDataDeleteHint
source: Deleting this data will permanently remove your account, and this cannot be recovered.
de: Das Löschen dieser Daten wird deinen Account permanent entfernen. Dies kann in Löschung aller eigegebenen Daten resultieren.

# PersonalDataDeleteHeading
source: Delete Personal Data
de: Personenbezogene Daten löschen

# PersonalDataDeleteButton
source: Delete data and close my account
de: Lösche Daten und schließe meinen Account

# UserAdd
source: Add user
de: Benutzer hinzufügen
