Repository: Stra1ghter/HahaBuch
Catalog: src/HahaBuch/LocalizedIdentityErrorDescriber.*.resx
Languages: de

# DefaultError
source: An undefined error occurred.
de: Ein unbekannter Fehler ist aufgetreten.

# PasswordUniqueChars
source: Passwords require {0} unique chars.
de: Das Passwort muss mindestens {0} verschiedene Zeichen enthalten.

# RecoveryCodeRedemptionFailed
source: Your recovery code was not redeemed.
de: Der Recovery Code wurde nicht eingelöst.

# PasswordRequiresUpper
source: Passwords require at least one upper case character ('A'-'Z').
de: Passwörter müssen mindestens ein großgeschriebenes Zeichen ('A'-'Z') enthalten.

# UserNotInRole
source: You are not in role {0}.
de: Sie sind nicht in Rolle {0}.

# ConcurrencyFailure
source: Concurrency error, the object has been changed.
de: Optimistischer Sperrfehler, das Objekt wurde geändert.

# PasswordMismatch
source: Wrong password.
de: Falsches Passwort.

source: Invalid token.
de: Token nicht valide.

# LoginAlreadyAssociated
source: Login does already exist.
de: Ein Benutzer mit diesem Login existiert bereits.

# InvalidEmail
source: Email '{0}' is invalid.
de: Die E-Mail '{0}' ist ungültig.

# InvalidRoleName
source: Role '{0}' is invalid.
de: Die Rolle '{0}' ist ungültig.

# InvalidUserName
source: The login '{0}' is invalid, he must only contain letters and numbers.
de: Der Login '{0}' ist ungültig, er kann nur Buchstaben oder Zahlen enthalten.

# DuplicateUserName
source: The user name '{0}' is already in use.
de: Der Benutzername '{0}' wird bereits verwendet.

# DuplicateEmail
source: The email '{0}' is already in use
de: Die E-Mail '{0}' wird bereits verwendet.

# DuplicateRoleName
source: The role '{0}' is already in use.
de: Der Rolle '{0}' wird bereits verwendet.

# UserAlreadyHasPassword
source: Please choose another password.
de: Bitte ein anderes Passwort verwenden.

# UserLockoutNotEnabled
source: Lockout is not enabled for this user.
de: Die Sperrung ist für diesen Benutzer nicht aktiviert.

# UserAlreadyInRole
source: The user already has the role '{0}'.
de: Der Benutzer hat bereits die Rolle '{0}'.

# PasswordTooShort
source: Password must be at least {0} characters long.
de: Passwörter müssen mindestens {0} Zeichen lang sein.

# PasswordRequiresNonAlphanumeric
source: Passwords require at least one non-alphanumerical character.
de: Passwörter müssen mindestens ein nicht alphanumerisches Zeichen enthalten.

# PasswordRequiresDigit
source: Passwords require at least one digit ('0'-'9').
de: Passwörter müssen mindestens eine Ziffer ('0'-'9') enthalten.

# PasswordRequiresLower
source: Passwords require at least one lower case letter ('a'-'z').
de: Passwörter müssen mindestens ein kleingeschriebenes Zeichen ('a'-'z') enthalten.
